# -*- coding: utf-8 -*-

empty_bts = bytes(4)                    #пустые 4 байта в переменную, в будущем !не поменять!
print (empty_bts)

first_bts = bytes ("Hello", "utf-8")	#запись слова в формате байт [utf-8] в переменную
print (first_bts)

second_bts = bytes ('\x6D', "utf-8")	#запись буквы в шестнадцатеричном формате по-таблице utf-8
print (second_bts)

#-----------------------------------------------------------------------------------------------------------------------------------------------------
print ("\n")

bts = bytearray ( "\x6C \x6B", "utf-8")
print (bts)

bts[0] = 0x6D														#изменение \x6C -> 0x6D(\x6D)
print (bts)
print ("\n")

print ('[m] в шестнадцатеричном представлении: %x' %bts[0])			#символ в число в 16x СС
print ("\n")
print ('[m] в восьмеричном представлении: %o' %bts[0])				#символ в число в 8x СС
print ("\n")
print ('число [0x6D] как символ: %c' %bts[0])						#символ из 16x числа
print ("\n")

bts.append (0x20)													#отступ в формате utf-8, в DEC(32) -> bts.append (32)
bts.append (0x6E)													#добавление в конец нового символа [n]
print (bts)